share/man/man9/VOP_UBOP.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2020 Matthew Macy
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd October 13, 2020
.Dt VOP_UBOP 9
.Os
.Sh NAME
.Nm VOP_UBOP
.Nd read or write a file system buffer
.Sh SYNOPSIS
.In sys/param.h
.In sys/vnode.h
.In sys/uio.h
.Ft int
.Fn VOP_UBOP "struct vnode *vp" "struct uio_bio *uio" "int io_flags"
.Sh DESCRIPTION
The arguments are:
.Bl -tag -width 2n
.It Fa vp
The vnode that the operation is for.
.It Fa uio
The context for the operation.
.It Fa flags
The flags for the operation:
.Bl -tag -width ".Dv FOF_OFFSET"
.It Dv FOF_OFFSET
uio_offset is valid.
.It Dv FAPPEND
Write to the end of the file.
.El
.El
.Pp
This call either reads from, writes to, or syncs a file, depending on the value of
.Fa uio->uio_cmd .
.Sh RETURN VALUES
Zero if completed immediately, EINPROGRESS otherwise.
Errors should be signalled by setting UIO_BIO_ERROR on uio_flags field in struct uio_bio,
and setting uio_error to the appropriate errno value.
.Sh SEE ALSO
.Xr uio_bio 9 ,
.Xr vnode 9
.Sh AUTHORS
This manual page was written by
.An Matthew Macy .
